Repository: eunhyekoo/glo_project
Catalog: feedback/TMData/[Naver] WEBTOON LATAM_+99 Reinforced Wooden Stick.tmx
Source language: en
Languages: es_419

source: would you like to accept this quest? yes/no.
es_419: ¿Aceptas esta misión? Sí/No

source: lv.{j}24
es_419: Nv. 24

source: the ascended plane has been destroyed.
es_419: El plano astral ha sido destruido.

source: sarang’s room
es_419: Habitación de Sarang

source: all I need to do is dodge your silly attacks.
es_419: Solo debo esquivar tus tontos ataques.

source: damn.
es_419: Rayos.

source: 21 years old.
es_419: Edad: 21 años.

source: ne{j}hkwayeke?{j}ee
es_419: ¿Hkwayeke?

source: award
es_419: PREMIO

source: when’s the next update coming?
es_419: ¿Cuándo es la próxima actualización?

source: he’s not a regular human.
es_419: No es un humano común y corriente.

source: you have been kicked from the party.
es_419: Te han expulsado del grupo.

source: the new items that are on the market are all top-ranking items worth a total of approximately 150 billion won.
es_419: Los nuevos objetos que están en el mercado son de la categoría más alta y valen aproximadamente 150 000 millones de wones.

source: but at the time, I had no idea it was her.
es_419: PERO, EN ESE ENTONCES, NO SABÍA QUE ERA ELLA.

source: ...you’re dead.
es_419: Estás muerto.

source: leader of the cross line guild, suho
es_419: Suho, líder del Gremio Cruzada Roja

source: you can kill them all you want.
es_419: Puedes matarlos todo lo que quieras.

source: because of its highly weak durability, it will break just after a few hits.
es_419: Debido a su poca durabilidad, se rompe después de unos cuantos golpes.

source: pardon?
es_419: ¿Qué?

source: who even plays this game anymore?
es_419: ¿Quién sigue jugando a esto?

source: Producerㆍdu-yeop
es_419: Producción: Du-yeop

source: really?
es_419: ¿En serio?

source: I got kicked off of chrono life!
es_419: ¡Me sacaron de Chrono Life!

source: has played chrono life for three months now.
es_419: Juega a Chrono Life desde hace tres meses.

source: I’m an average college student who enjoys playing chrono life.
es_419: Soy un universitario mediocre que disfruta jugando a Chrono Life.

source: grab
es_419: TAC

source: we apologize for the inconvenience.
es_419: Disculpen las molestias.

source: if you go over there...
es_419: Si vas hacia allí…

source: there’s one more left?
es_419: ¿Aún queda alguien?

source: ohohoho!
es_419: ¡Jo, jo, jo, jo!

source: captain luv...
es_419: Capitana Amor…

source: [urus] has relinquished his physical form.
es_419: [Urus] ha abandonado su forma física.

source: episode 13. character deleted (1)
es_419: Episodio 13: Personaje eliminado (1)

source: what is this control-c control-v bullshit?
es_419: ¿Qué es esta m*erda de Control+C y Control+V?

source: I am pretty hungry. maybe I’ll get a bowl of soup.
es_419: Tengo mucha hambre. Tal vez me tome un plato de sopa.

source: that’s just how things work.
es_419: Así son las cosas.

source: th-the hallasan guild?!
es_419: ¡¿El Gremio de Hallasan?!

source: dd{j}who is that?
es_419: ¿Quién es ese?

source: what the hell is the game’s balance team doing?!
es_419: ¡¿En qué rayos piensan los que equilibran el juego?!

source: mirror of clones.
es_419: Espejo de clones.

source: strike the enemy multiple times.
es_419: Golpea al enemigo múltiples veces.

source: hmph
es_419: JUM

source: hello? urus!
es_419: ¡Oye! ¡Urus!

source: how do you know how old I am?
es_419: ¿Cómo sabes cuántos años tengo?

source: how do you like it?!
es_419: ¡¿Y qué te parece?!

source: it’s been a while...
es_419: Tanto tiempo…

source: I will enjoy myself.
es_419: Voy a disfrutar.

source: what stat did he put it into?
es_419: ¿Qué habilidad mejoró?

source: zoomed-in
es_419: CON ZOOM

source: uhh, cutie? what was that?
es_419: Eh, guapo. ¿Qué fue eso?

source: a child’s life being ruined like this...
es_419: La vida de una niña arruinada de esa manera…

source: the soul of the [dagger] has entered your body.
es_419: El alma de [la daga] ha entrado en tu cuerpo.

source: umm...
es_419: Mmm…

source: as well as singer-songwriter of the nation.
es_419: así como también la mejor compositora del país.

source: don’t you know it’s way more fun...
es_419: ¿No sabes que es más divertido…

source: since we’re neighbors, I thought I’d bring over a sweet treat.
es_419: Como ahora somos vecinos, pensé en traer algo dulce.

source: I’m your first love!
es_419: ¡Soy su primer amor!

source: ...unless it was a bug?
es_419: … a menos que haya un error?

source: blabber
es_419: BLA

source: uhh...
es_419: Ehh…

source: def going out of business.
es_419: Van a ir a la quiebra.

source: I think he’s just salty no one’s letting him join their party.
es_419: Creo que está enojado porque ningún grupo lo acepta.

source: that’s a secret.
es_419: Eso es un secreto.

source: if you don’t, we’re all done for!
es_419: Si no lo hace, ¡estamos perdidos!

source: hallasan guild manager mr. heo
es_419: Administrador del Gremio de Hallasan Sr. Heo

source: no matter how low-leveled these monsters are, it can be dangerous to take on a whole mob on your own.
es_419: Por más que estos monstruos sean de bajo nivel, es peligroso enfrentarse a toda una manada por tu cuenta.

source: you really are something else!
es_419: ¡Realmente es excepcional!

source: ...the voracious urakan.
es_419: … Urakan, el voraz.

source: hiring a mercenary was all you could do?
es_419: ¿Solo se te ocurrió contratar a una mercenaria?

source: StoryㆍHONGSIL artㆍJIPERY
es_419: Arte: Jipery

source: you have lost a portion of your exp. you will now be revived in a safe area.
es_419: Perdiste puntos de experiencia. Revivirás en una zona segura.

source: ...mother?
es_419: … madre?

source: at least practice fighting some monster mobs while I’m gone!
es_419: ¡Al menos practica pelear con algunos monstruos mientras no estoy!

source: he’s a--
es_419: Él es…

source: eek!
es_419: ¡Aaj!

source: then, there was that time I met with the chrono life ceo.
es_419: Luego, conocí al CEO de Chrono Life.

source: I’m 21 years old.
es_419: Tengo 21 años.

source: heheheheh hehehehehe heheheheh.
es_419: Je, je, je, je, je. Je, je, je, je, je. Je, je, je, je.

source: I’m going to just farm on my own!
es_419: ¡Voy a jugar sola!

source: my manager told me not to mention the fairy tales!
es_419: ¡Mi agente me pidió que no dijera nada de los cuentos de hadas!

source: stomp
es_419: PUM

source: hopping through the forest!
es_419: … saltaba por el bosque.

source: googoo gaga.
es_419: GUGU GAGA…

source: now listen up, kid.
es_419: Bueno, escúchame, niña.

source: congratulations!
es_419: ¡Felicitaciones!

source: there’s no doubt that you had to use an exorbitant amount of money to achieve this amount of strength.
es_419: Sin duda debiste haber usado una cantidad exorbitante de dinero para tener tanta fuerza.

source: Assisted by:
es_419: Con ayuda de:

source: that means your little friend isn’t here, either.
es_419: Eso quiere decir que tu amiguito tampoco está aquí.

source: ooh.
es_419: Aah.

source: and who the hell are you?!
es_419: ¡¿Q-quién rayos eres tú?!

source: hallasan guild manager mr. lee
es_419: Administrador del Gremio de Hallasan Sr. Lee

source: it’s only been 30 minutes since I got back from school!
es_419: ¡Hace tan solo 30 minutos que volví de la escuela!

source: selfish and temperamental as ever.
es_419: Egoísta y caprichosa como siempre.

source: ...it’s different here.
es_419: … aquí es diferente.

source: of course it was, you fool.
es_419: Pues claro que sí, tonto.

source: wh-what’s going on?!
es_419: ¡¿Q-qué está pasando?!

source: I got it!
es_419: ¡La conseguí!

source: ...this left sarang with a painful memory she would never forget.
es_419: … esto le dejó a Sarang un recuerdo doloroso que nunca olvidaría.

source: you can stay as long as you please!
es_419: ¡Puede quedarse todo lo que quiera!

source: what does that mean?
es_419: ¿Qué significa eso?

source: okay, fine.
es_419: Bueno, está bien.

source: you’re nothing but mere fodder!
es_419: ¡No eres más que alimento para mí!

source: welcome to my humble abode!
es_419: ¡Bienvenidos a mi humilde morada!

source: boss! boss!
es_419: ¡Jefe! ¡Jefe!

source: well, I think I’ve got the gist of it.
es_419: Bueno, creo que ya estoy entendiendo.

source: and...
es_419: Y…

source: learn your place, you little b*tch.
es_419: Ubícate, z*rra.

source: how annoying.
es_419: Qué molesto.

source: ugh, his face just pisses me off.
es_419: Agh, hasta su cara me cabrea.

source: at least that’s what I think.
es_419: Al menos eso creo.

source: heheh...
es_419: Je, je…

source: revenge!{j}r{j}r{j}r{j}r{j}r
es_419: ¡Venganza!

source: hallasan guild leader mr. wang
es_419: Líder del Gremio de Hallasan Sr. Wang

source: rumble
es_419: BRUUUM

source: that’s a pretty cool spell name.
es_419: Ese hechizo tiene un nombre genial.

source: huff...
es_419: Juff…

source: ...to practice not killing these things in one swing!
es_419: … ¡es practicar cómo no matar a estas cosas de un solo golpe!

source: I happened to come across it... haha...
es_419: La encontré de casualidad… ja, ja…

source: what’s going on?
es_419: ¿Qué está pasando?

source: to be honest, I was still a newbie user not too long ago.
es_419: Para ser sincero, hasta hace poco era un novato.

source: w-wait a minute!
es_419: ¡U-un momento!

source: posted 1 minute ago
es_419: Publicado hace 1 minuto

source: and you have been returned three times the amount of ability points used up until now.
es_419: Y se te ha devuelto el triple de puntos de habilidad usados hasta ahora.

source: look, I’m a worm!
es_419: Miren, ¡soy un gusano!

source: ...there’s no way one person could take on three million people at once.
es_419: … no es posible que alguien acabe con tres millones de personas a la vez.

source: th-they just left it behind.
es_419: L-las dejaron tiradas.

source: goooooo!{j}rl
es_419: ¡Vamoooos!

source: ...is nothing more than some played-out plot of a tv drama.
es_419: … no es más que la trama repetida de un drama de televisión.

source: I’m sure you couldn’t stop thinking about me since the day we met.
es_419: Seguro que no dejaste de pensar en mí desde el día en que nos conocimos.

source: don’t forget to like, subscribe, and turn on notifications!
es_419: ¡No se olviden de poner “me gusta”, suscribirse y activar las notificaciones!

source: he really is worth all of that reward money. he’s really good.
es_419: La recompensa que ofrecen está justificada. Es realmente bueno.

source: he’s a boss monster that needs a specific strategy to take down.
es_419: Es un jefe al que hay que derrotar con una estrategia específica.

source: did you cut the power or something?!
es_419: ¡¿Cortó la electricidad o algo así?!

source: I’m bored.
es_419: Estoy aburrida.

source: now we just need to get in one more good attac-
es_419: Ahora debemos lanzar otro buen ataq…

source: gah!
es_419: ¡Aah!

source: I can’t hear you!
es_419: ¡No te escucho!

source: ugh, pipe down already!
es_419: Agh, ¡cállate ya!

source: just happen to pick it up...
es_419: de casualidad…

source: yeah, I can totally tell.
es_419: Sí, me doy cuenta.

source: toss
es_419: FUUF

source: wh...
es_419: ¿Qué…?

source: hyaaaaa!
es_419: ¡JIAAAAA!

source: ...sarang continued to be exploited by her own parents.
es_419: … sus propios padres siguieron explotando a Sarang.

source: really now?
es_419: ¿En serio?

source: pause
es_419: FRENA

source: that thing costs over 20,000,000,000 won*.
es_419: Eso costó más de 20 000 millones de wones*.

source: have all of our guild members gather in this dungeon.
es_419: Que todos los miembros del gremio vengan a esta mazmorra.

source: and now...
es_419: Y ahora…

source: you really got him with that one!
es_419: ¡Eso sí que le hizo daño!

source: splat
es_419: PLAF

source: CEO’s office
es_419: OFICINA DEL CEO

source: this selected stat has been enhanced.
es_419: La habilidad seleccionada ha sido mejorada.

source: are you kidding me?
es_419: ¿Es una broma?

source: this kid knows how to have a good time, huh?!
es_419: Este chico sí sabe divertirse, ¡¿no?!

source: hey, roach junior.
es_419: Oye, cucaracha hijo.

source: fwoosh
es_419: FUUUSH

source: have you guys forgotten about what this sicko has done?!
es_419: ¡¿Se olvidaron de lo que hizo este enfermo?!

source: revenge!{j}r{j}r{j}r{j}r
es_419: ¡Venganza!

source: you’re officially kicked out of our party!
es_419: ¡Quedas oficialmente fuera del grupo!

source: "born to sing." she was praised by everyone.
es_419: “Nació para cantar”. La elogiaba todo el mundo.

source: it’s like I’ve seen him somewhere before.
es_419: Es como si lo conociera de algún lado.

source: I don’t understand why...
es_419: No entiendo por qué…

source: so regardless of your job class, you need to raise your strength stat to equip them.
es_419: Así que, sin importar su clase, debe subir el nivel de fuerza para poder usar el equipamiento.

source: Staff Rock LeeㆍBobaccari KongsunaㆍWallabyㆍBalkwang Beoseot
es_419: Equipo: Rock LeeㆍBobaccari KongsunaㆍWallabyㆍBalkwang Beoseot

source: k{j}y{j}a{j}a{j}a
es_419: KIAAAA

source: episode 8. heavy spenders (2)
es_419: Episodio 8: Grandes consumidores (2)

source: illustrated by shurishu
es_419: Ilustración de Shurishu

source: however,
es_419: Sin embargo,

source: roar!
es_419: ¡Raar!

source: gosh.
es_419: Cielos.

source: say hello to the furry guy for me.
es_419: Saluda al peludito de mi parte.

source: mmph...
es_419: Jum…

source: there was that time all of the gorus had disappeared in a flash.
es_419: Como esa vez que todos los gorus desaparecieron en un instante.

source: human child...
es_419: Niño humano…

source: later, you old farts!
es_419: ¡Nos vemos, vejestorios!

source: as the leader of the world guild alliance, these are my orders!
es_419: Como líder de la alianza mundial de gremios, ¡estas son mis órdenes!

source: I knew the vibe was off in the village.
es_419: Sabía que había un clima raro en la aldea.

source: does this mean...
es_419: Eso significa…

source: what’s this shadow?
es_419: ¿Y esta sombra?

source: also, where are all of your expensive items? why are you only wearing undies?
es_419: Además, ¿dónde están todos sus objetos caros? ¿Por qué solo traen calzoncillos puestos?

source: because of its highly weak durability, it will break just after a few hits. durability:
es_419: Debido a su poca durabilidad, se rompe después de unos cuantos golpes.

source: I guess I have no choice.
es_419: Creo que no tengo opción.

source: after just one livestream, he became the most popular streamer in the world overnight.
es_419: Después de tan solo un stream en vivo, se volvió el streamer más conocido del mundo.

source: ...that means captain luv will come back.
es_419: … eso hará que vuelva la capitana Amor.

source: that clickbait tho{j}su
es_419: Ese es un título cazaclics.

source: are you all right?!
es_419: ¡¿Está bien?!

source: ...being deleted.
es_419: … eran borrados.

source: however, in just 1 second, he makes at least 150 dollars.
es_419: Pero, en solo un segundo, Gates gana como mínimo 150 dólares.

source: absolutely scrumptious!
es_419: ¡Absolutamente delicioso!

source: when did we ever decide that?!
es_419: ¡¿En qué momento decidimos eso?!

source: scythe of the ascended
es_419: Guadaña de los Ascendidos.

source: 850,617 players.
es_419: 850 617 jugadores.

source: [details]
es_419: [Detalles]

source: we are declaring war against this criminal!
es_419: ¡Le declaramos la guerra a este criminal!

source: I can’t really tell because he’s wearing a hood on the wanted posters.
es_419: No sé, porque en los carteles de “se busca” está con capucha.

source: currently boosting ji-u
es_419: Subiendo el nivel de Jiwoo

source: the default weapon given to beginners.
es_419: El arma por defecto de los principiantes.

source: I am the strongest boss monster.
es_419: Soy el monstruo más fuerte.

source: that game is seriously the best.
es_419: Realmente es el mejor juego.

source: ...this amazing, fantastic strength of mine.
es_419: … la formidable y fantástica fuerza que tengo.

source: I’m quitting chrono life.
es_419: Me voy de Chrono Life.

source: think about it.
es_419: Piénsalo.

source: we don’t accept inexperienced players for our party.
es_419: No queremos gente sin experiencia en el grupo.

source: why, you!
es_419: ¡Qué rayos!

source: this can’t be...
es_419: No puede ser…

source: ...I found that your wooden stick was just a regular item. it wasn’t a bug at all.
es_419: … descubrí que ese palo de madera era un objeto normal. No había ningún error.

source: you clearly came looking for me.
es_419: Claramente viniste a buscarme.

source: all residents and travelers of front village!
es_419: ¡Habitantes y viajeros de la aldea Front!

source: they... left?
es_419: ¿Se… fueron?

source: where is my next feast?
es_419: ¿Dónde está mi próximo banquete?

source: probably about eight?
es_419: ¿Unos ocho, quizá?

source: ...you f*ckers.
es_419: … hijos de p*ta.

source: i-it’s not that I’m weak, you’re just incredibly powerful...
es_419: N-no es que yo sea débil, es que tú eres increíblemente poderoso…

source: it's some rice cakes.
es_419: Es un pastel de arroz.

source: episode 6.{j}I’m your love, luv!
es_419: EPISODIO 6: ¡Soy tu amorcito, Amor!

source: if you want to kill me...
es_419: Si quieren matarme…

source: I’ll be back for that cape, cutie.
es_419: Volveré por esa capa, lindo.

source: nice!
es_419: ¡Genial!

source: how could they tear apart a child from her parents like that?
es_419: ¿Cómo pueden separar a una niña de sus padres así nomás?

source: artㆍJIPERY{j}story: hongsil, art: jiperi, producer: du-yeop, staff: jaehyeon lee, rokri, bobakari, kongsna, wallabi
es_419: Arte: Jipery{j}

source: freedom.
es_419: Libertad.

source: there’s a monster at the central plaza!
es_419: ¡Hay un monstruo en la plaza central!

source: ...another reason.
es_419: … alguna otra razón.

source: you have been granted with special benefits of the [master novice].
es_419: Se te han concedido las ventajas especiales de [maestro novato].

source: I’m screwed.
es_419: Estoy jodido.

source: users all over the world are trying day and night to accomplish this feat.
es_419: Usuarios de todo el mundo intentan día y noche alcanzar esa meta.

source: a-are you okay?!
es_419: ¡¿E-está bien?!

source: wait, what?
es_419: Pero ¿qué?

source: dagger of the ascended
es_419: Daga de los Ascendidos.

source: however, certain special characters such as "twin-headed dragon, urus" don't respawn.
es_419: Sin embargo, ciertos personajes especiales, como "Urus, el dragón de dos cabezas", no reaparecen.

source: d1{j}are you kidding me?
es_419: ¿Es una broma?

source: not you. this entire planet.
es_419: No tú. El planeta.

source: viewers:
es_419: Espectadores:

source: w{j}h{j}o{j}o{j}h{j}o{j}o{j}!
es_419: ¡IUUUUUPI!

source: and each time they’ve gotten into it, luv has won.
es_419: Y cada vez que se encuentran, Amor les gana.

source: I’m glad we spent all of that money to build this!
es_419: ¡Me alegra que hayamos gastado tanto para construir esto!

source: rr{j}go, go, go!
es_419: ¡Vamos, vamos!

source: and why that one?!
es_419: ¡¿Y por qué en esa?!

source: wh-where am I?!
es_419: ¡¿D-dónde estoy?!

source: d...
es_419: Pa…

source: ...the data of the three bosses of urus’ legion...
es_419: … los datos de los tres jefes de la legión de Urus…

source: don’t ask me.
es_419: Yo no tengo ni idea.

source: was so much fun.
es_419: era muy divertido.

source: what now?
es_419: ¿Y ahora qué?

source: haha
es_419: Ja, ja

source: +3 knight’s two-handed sword
es_419: Mandoble de caballero +3

source: whether they decide to slay the strongest bosses...
es_419: Si quieren eliminar a los enemigos finales más poderosos…

source: looks like I’ve already got someone trying to get in my way!
es_419: ¡Parece que ya hay alguien que quiere entrometerse!

source: roach mom
es_419: Cucaracha mamá

source: press
es_419: APRIETA

source: hmm, let’s see.
es_419: Mmm, veamos.

source: he’s still doing these crappy streams, huh?{j}jl
es_419: ¿Aún sigue con estos streams de porquería?

source: I’ll tell you.
es_419: Te contaré.

source: a "coincidence"?
es_419: ¿”Casualidad”?

source: that’s because he’s not a user.
es_419: Eso es porque no es un usuario.

source: did a dragon use its fire breath just now?!
es_419: ¡¿Acaba de atacarnos un dragón?!

source: hey, undies.
es_419: Oye, Calzón.

source: what are you talking abo--
es_419: ¿De qué estás hablan…?

source: the first day he picked up that wooden stick, he slayed approximately 800,000 people.
es_419: El primer día que usó el palo de madera, mató a unos 800 000 jugadores.

source: but, I was mistaken.
es_419: Pero me equivoqué…

source: beginner
es_419: Principiante

source: shiver
es_419: TIEMBLA

source: so what I need is...
es_419: Así que lo que necesito…

source: I mean,
es_419: Digo,

source: please join our guild...
es_419: Por favor, únete a nuestro gremio…

source: hiss
es_419: SSSS

source: plop
es_419: PLOF

source: pull
es_419: FRAC

source: episode 2. king of the netherworld, twin-headed dragon urus
es_419: Episodio 2: Urus, dragón de dos cabezas, el rey del inframundo

source: m-me?!
es_419: ¡¿A-a mí?!

source: [mirror of clones]
es_419: [Espejo de clones]

source: you have failed to reinforce your item.
es_419: Has fallado en mejorar tu objeto.

source: wow.
es_419: Vaya.

source: episode 10. maximum level
es_419: Episodio 10: Nivel máximo

source: phew!
es_419: ¡Fiu!

source: look at how fast the viewer count is going up.{j}Re
es_419: Miren qué rápido sube la cantidad de espectadores.

source: h{j}y{j}a{j}a{j}a{j}a
es_419: KIAAAAA

source: don’t tell me you’re...
es_419: No me digas que tú…

source: I picked it up after I killed urak--
es_419: La recogí luego de matar a Urak…

source: and that percentage continues to fall the higher you get.
es_419: Y ese porcentaje disminuye cuanto más subes.

source: that’s not the real me, I swear.
es_419: No soy así en verdad, lo juro.

source: wave
es_419: SALUDA

source: is part of his "eight mirrors" skill.
es_419: son parte de su habilidad de “ocho espejos”.

source: whoa, what was that skill she just used?
es_419: Guau, ¿qué habilidad usó?

source: why are you acting so shocked?
es_419: ¿Por qué estás tan sorprendido?

source: he needs to be banned from the game.
es_419: Deberían expulsarlo del juego.

source: h-hey!
es_419: ¡O-oiga!

source: w-well, what do I do now then?
es_419: B-bueno, ¿y ahora qué hago?

source: s{j}w{j}o{j}o{j}o{j}o
es_419: FUOOOSH

source: I have just one request.
es_419: tengo solo una petición.

source: let’s say you were to destroy this planet. you’d end up dead, too.
es_419: Digamos que destruyes el planeta. Tú también terminarías muerto.

source: chief of marketing
es_419: JEFE DE MARKETING

source: answer me if you don’t want to die.
es_419: Contéstame si no quieres morir.

source: so,
es_419: Entonces,

source: die, you lowly human!
es_419: ¡Muere, humano despreciable!

source: I don’t have any ulterior motives.
es_419: No tengo segundas intenciones.

source: so I wanted to reward myself.
es_419: Así que quise premiarme.

source: loser lmao{j}86
es_419: Qué perdedor, LOL

source: master level
es_419: Nivel maestro

source: ...that me?
es_419: … soy yo?

source: w-we’re screwed!
es_419: ¡E-estamos perdidos!

source: leader ofthe righteous bandits guild, hong
es_419: Hong, líder del Gremio de los Bandidos Honestos

source: come join our guild!
es_419: ¡Únete a nuestro gremio!

source: kick
es_419: BAM

source: what if I sold my items...
es_419: ¡¿Y si vendo mi equipamiento…

source: I started coming here when I first started the company for chrono life and it was in its first stages of development.
es_419: Empecé a venir cuando abrí la empresa de Chrono Life, que estaba en las primeras etapas de desarrollo.
